Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs.DialogType
An integer that describes the standard Windows type of the dialog box.
Since:
2010

Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs.Message
The message that has been displayed in the dialog box.
Since:
2010

Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs
The event arguments used by the DialogBoxShowing event when a Windows message box is about to be displayed in Revit.
Remarks:
When the application receives this object, a simple message box is about to be displayed in Revit that
requires user interaction. The OverrideResult function can be used to cause the dialog
to be dismissed and return a desired result code.
Since:
2010